{
    "iam": "I am",
    "home": "Home",
    "about": "About Me",
    "resume": "Resume",
    "portfolio": "Portfolio",
    "services": "Services",
    "contact": "Contact",
    "about_description": "I am a Software Developer with 2 years of experience in software, game, and web development. I am committed to creating innovative technological solutions.",
    "about_content_description": "As a Software Developer and Game Developer, I focus on creating innovative solutions and interactive experiences through coding and game development.",
    "birthday:": "Birth Year:",
    "phone:": "Phone Number:",
    "city:": "City:",
    "age:": "Age:",
    "freelance:": "Freelance:",
    "freelance_condition": "Available",
    "about_content_sub_description": "As a technology professional, I have expertise in developing software applications and games, and I am committed to delivering the best results to clients and users. With experience in various projects, I am ready to collaborate and create creative solutions that meet your needs.",
    "skills": "Skills",
    "skills_description": "I have expertise in various fields of software and game development.",
    "resume_description": "Experienced in developing software and games with a focus on efficiency, performance, and optimal user experience. Skilled in backend development, API integration, and scalable system design.",
    "education": "Education",
    "professional_experience": "Professional Experience",
    "computer_science": "Computer Science",
    "bachelor": "Pakuan University (Bogor, Indonesia)",
    "bachelor_description": "Mastering various programming languages such as Java, Python, C++, and C#. Deep understanding of data structures, algorithms, object-oriented programming, and software development paradigms. Actively involved in practical projects that sharpen skills in software development.",
    "bachelor_sub_description": "Additionally, studied software development cycles, project management, and software testing to ensure the quality and reliability of the produced products. For the final project, successfully designed and developed a solar power plant simulation application using Unity game engine as a demonstration of programming and interactive simulation skills.",
    "accounting": "Accounting",
    "vocational_highschool": "SMK Negeri 1 Cibarusah (Bekasi, Indonesia)",
    "surya_synergy_solutions_present": "December 2023 - Present",
    "surya_synergy_solutions_title": "PT. Surya Synergy Solutions, Bogor, Indonesia",
    "surya_synergy_solutions_description_0": "Created backend concepts using Node.js and SQL databases to support secure and efficient voting transaction processes.",
    "surya_synergy_solutions_description_1": "Used Laravel for web design to support the implementation of a blockchain voting system.",
    "surya_synergy_solutions_description_2": "Designed solutions that combine blockchain technology with smart contracts for data security and accurate voting results.",
    "surya_synergy_solutions_description_3": "Performed maintenance and updates on applications created for clients.",
    "self_employed_present": "August 2023 - Present",
    "self_employed_title": "Self-Employed, Bekasi, Indonesia",
    "self_employed_description_0": "Developed applications to meet client needs for Content Interaction Bot using .Net as the interface and Javascript as the backend.",
    "self_employed_description_1": "Developed applications to meet client needs for WhatsApp Business Bot using .Net as the interface and Javascript as the backend.",
    "self_employed_description_2": "Performed maintenance and updates on applications created.",
    "handmad_studio_present": "February 2024 - August 2024",
    "handmad_studio_title": "Handmad Studio, Bogor, Indonesia",
    "handmad_studio_description_0": "Developed and released Nurse's Curse, a horror game focusing on a tense atmosphere and unique gameplay.",
    "handmad_studio_description_1": "Created WIROX RATS: 3D Rat Shooting, a first-person shooter game featuring 3D shooting mechanics.",
    "handmad_studio_description_2": "Both games were optimized to run smoothly and provide a stable gaming experience.",
    "handmad_studio_description_3": "Involved in various aspects of development, including implementing enemy AI, navigation systems, and state machine management.",
    "portfolio_description": "I have various projects that reflect my expertise in software development and game creation. Each project is designed to provide innovative and effective solutions while ensuring an optimal user experience.",
    "contact_description": "I am ready to help! Feel free to contact me if you have any questions or need more information.",
    "address": "Address",
    "whatsapp_me": "WhatsApp Me",
    "email_me": "Email Me",
    "project_information": "Project Information",
    "category": "Category",
    "client": "Client",
    "project_date": "Project Date",
    "project_url": "Project URL",
    "portfolio_details": "Portfolio Details"
}
