{
    "iam": "Saya adalah",
    "home": "Beranda",
    "about": "Tentang Saya",
    "resume": "Riwayat Hidup",
    "portfolio": "Portofolio",
    "services": "Layanan",
    "contact": "Kontak",
    "about_description": "Saya adalah seorang Software Developer dengan pengalaman 2 tahun di pengembangan perangkat lunak, game, dan website. Saya berkomitmen untuk menciptakan solusi teknologi inovatif.",
    "about_content_description": "Sebagai Software Developer dan Game Developer, saya fokus pada penciptaan solusi inovatif dan pengalaman interaktif melalui pengkodean dan pengembangan game.",
    "birthday:": "Tahun Lahir:",
    "phone:": "Nomor Telepon:",
    "city:": "Tempat Tinggal:",
    "age:": "Umur:",
    "freelance:": "Freelance:",
    "freelance_condition": "Bersedia",
    "about_content_sub_description": "Sebagai seorang profesional di bidang teknologi, saya memiliki keahlian dalam mengembangkan aplikasi perangkat lunak dan game, serta berkomitmen untuk memberikan hasil terbaik kepada klien dan pengguna. Dengan pengalaman dalam berbagai proyek, saya siap untuk berkolaborasi dan menciptakan solusi kreatif yang memenuhi kebutuhan Anda.",
    "skills": "Keterampilan",
    "skills_description": "Saya memiliki keahlian dalam berbagai bidang pengembangan perangkat lunak dan game.",
    "resume_description": "Berpengalaman dalam mengembangkan perangkat lunak dan game dengan fokus pada efisiensi, performa, dan pengalaman pengguna yang optimal. Memiliki keterampilan dalam pengembangan backend, integrasi API, dan desain sistem yang skalabel.",
    "education": "Pendidikan",
    "professional_experience": "Pengalaman Profesional",
    "computer_science": "Ilmu Komputer",
    "bachelor": "Universitas Pakuan (Bogor, Indonesia)",
    "bachelor_description": "Menguasai berbagai bahasa pemrograman seperti Java, Python, C++, dan C#. Memiliki pemahaman mendalam tentang struktur data, algoritma, pemrograman berorientasi objek, serta paradigma pengembangan perangkat lunak. Aktif terlibat dalam proyek-proyek praktis yang mengasah keterampilan dalam pengembangan perangkat lunak.",
    "bachelor_sub_description": "Selain itu, mempelajari siklus pengembangan perangkat lunak, manajemen proyek, dan pengujian perangkat lunak untuk memastikan kualitas serta keandalan produk yang dihasilkan. Pada tugas akhir, berhasil merancang dan mengembangkan aplikasi simulasi pembangkit listrik tenaga surya menggunakan game engine Unity sebagai demonstrasi keahlian dalam pemrograman dan simulasi interaktif.",
    "accounting": "Akuntansi",
    "vocational_highschool": "SMK Negeri 1 Cibarusah (Bekasi, Indonesia)",
    "surya_synergy_solutions_present": "Desember 2023 - Agustus 2024",
    "surya_synergy_solutions_title": "PT. Surya Synergy Solutions, Bogor, Indonesia",
    "surya_synergy_solutions_description_0": "Membuat konsep backend menggunakan Node.js dan database SQL untuk mendukung proses transaksi voting yang aman dan efisien.",
    "surya_synergy_solutions_description_1": "Menggunakan Laravel dalam perancangan web yang mendukung implementasi konsep blockchain voting system.",
    "surya_synergy_solutions_description_2": "Merancang solusi yang menggabungkan teknologi blockchain dengan smart contracts untuk keamanan data dan keakuratan hasil voting.",
    "surya_synergy_solutions_description_3": "Melakukan maintenance dan pembaruan pada aplikasi yang telah dibuat untuk client.",
    "self_employed_present": "Agustus 2023 - Sekarang",
    "self_employed_title": "Bekerja Mandiri, Bekasi, Indonesia",
    "self_employed_description_0": "Mengembangkan aplikasi untuk memenuhi kebutuhan klien terkait Content Interaction Bot dengan menggunakan .Net sebagai antarmuka dan Javascript sebagai backend.",
    "self_employed_description_1": "Mengembangkan aplikasi untuk memenuhi kebutuhan klien terkait Whatsapp Business Bot menggunakan .Net sebagai antarmuka dan Javascript sebagai backend.",
    "self_employed_description_2": "Melakukan maintenance dan pembaruan pada aplikasi yang telah dibuat.",
    "handmad_studio_present": "Februari 2024 - Agustus 2024",
    "handmad_studio_title": "Handmad Studio, Bogor, Indonesia",
    "handmad_studio_description_0": "Mengembangkan dan merilis game Nurse's Curse, sebuah game horor yang berfokus pada atmosfer menegangkan dan gameplay unik.",
    "handmad_studio_description_1": "Menciptakan WIROX RATS: 3D Rat Shooting, game first-person shooter yang menampilkan mekanisme tembak-menembak 3D.",
    "handmad_studio_description_2": "Kedua game berhasil dioptimalisasi untuk berjalan dengan lancar dan memberikan pengalaman bermain yang stabil.",
    "handmad_studio_description_3": "Terlibat dalam berbagai aspek pengembangan, termasuk implementasi AI musuh, sistem navigasi, dan pengaturan state machine.",
    "portfolio_description": "Saya memiliki berbagai proyek yang mencerminkan keahlian saya dalam pengembangan perangkat lunak dan pembuatan game. Setiap proyek dirancang untuk memberikan solusi yang inovatif dan efektif, serta memastikan pengalaman pengguna yang optimal.",
    "contact_description": "Saya siap membantu! Jangan ragu untuk menghubungi saya jika memiliki pertanyaan atau membutuhkan informasi lebih lanjut.",
    "address": "Alamat",
    "whatsapp_me": "Whatsapp Saya",
    "email_me": "Email Saya",
    "project_information": "Informasi Projek",
    "category": "kategori",
    "client": "klien",
    "project_date": "Tanggal Projek",
    "project_url": "URL Projek",
    "portfolio_details": "Detail Portofolio"
}
